//1. Завантаження данних - на цьому моменті
//треба відобразити статус завантаження
//2.Відображення данних, які ми завантажили,
//враховуючи конвертацію данних
//3. Якщо є помилка, то виводимо статус помилки
// і візуалізуємо через alert

export class List {
  //cтатуси
  STATE = {
    LOADING: 'loading',
    SUCCESS: 'success',
    ERROR: 'error',
  }

  //окрема властивість, яка буде мати
  //одне з цих трьох значень
  status = null
  //данні, які ми завантажили
  data = null
  //елемент, де ми будемо відображати данні
  element = null

  // приймає статус і данні, які
  //треба буде занести
  updateStatus = (status, data) => {
    //змінюємо статус
    this.status = status
    //змінюємо дата
    if (data) this.data = data

    //абстрактна функція відображення( бере element та
    //змінює його innerHTML) припевних статусах
    //треба відобразити різну верстку
    this.updateView()
  }

  //коли унаслідується class List ми її перезаписали
  //updateView = () => {}

  //для завантаження данних
  //loadData = async () => {}

  //для конвертації данних в фронтент вигляді
  //який нам зручно
  //convertData = () => {}
}
